Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.1.45/edc/PIC32MZ0512EFE144.PIC
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="rnnnnnnrrrrr-rrrrrrrrrrrr----nnn" edc:cname="Config" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000001001000000010010000010" edc:name="Config" edc:nmmrflags="0t" edc:nmmrid="192" edc:nzwidth="0x20" edc:por="10000000001001000000010010000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="K0" edc:desc="" edc:mask="0x7" edc:name="K0" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="MT" edc:desc="" edc:mask="0x7" edc:name="MT" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="AR" edc:desc="" edc:mask="0x7" edc:name="AR" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="AT" edc:desc="" edc:mask="0x3" edc:name="AT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BE" edc:desc="" edc:mask="0x1" edc:name="BE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BM" edc:desc="" edc:mask="0x1" edc:name="DS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MM" edc:desc="" edc:mask="0x3" edc:name="MM" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MDU" edc:desc="" edc:mask="0x1" edc:name="MDU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SB" edc:desc="" edc:mask="0x1" edc:name="SB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UDI" edc:desc="" edc:mask="0x1" edc:name="UDI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSP" edc:desc="" edc:mask="0x1" edc:name="DSP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISP" edc:desc="" edc:mask="0x1" edc:name="ISP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KU" edc:desc="" edc:mask="0x7" edc:name="KU" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="K23" edc:desc="" edc:mask="0x7" edc:name="K23" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrr--rrrrr" edc:cname="Config1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10011110100110110000110110011011" edc:name="Config1" edc:nmmrflags="0a" edc:nmmrid="320" edc:nzwidth="0x20" edc:por="10011110100110110000110110011011">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FP" edc:desc="" edc:mask="0x1" edc:name="FP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP" edc:desc="" edc:mask="0x1" edc:name="EP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CA" edc:desc="" edc:mask="0x1" edc:name="CA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PC" edc:desc="" edc:mask="0x1" edc:name="PC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="DA" edc:desc="" edc:mask="0x7" edc:name="DA" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DL" edc:desc="" edc:mask="0x7" edc:name="DL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DS" edc:desc="" edc:mask="0x7" edc:name="DS" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="IA" edc:desc="" edc:mask="0x7" edc:name="IA" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="IL" edc:desc="" edc:mask="0x7" edc:name="IL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="IS" edc:desc="" edc:mask="0x7" edc:name="IS" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="MMUsz" edc:desc="" edc:mask="0x3f" edc:name="MMUsz" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="r-------------------------------" edc:cname="Config2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="Config2" edc:nmmrflags="0b" edc:nmmrid="448" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="r-------rrrrrrrnrrrrrr-r-rrrr--r" edc:cname="Config3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000101000101011110101101000" edc:name="Config3" edc:nmmrflags="0c" edc:nmmrid="576" edc:nzwidth="0x20" edc:por="10000000101000101011110101101000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TL" edc:desc="" edc:mask="0x1" edc:name="TL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CDMM" edc:desc="" edc:mask="0x1" edc:name="CDMM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SP" edc:desc="" edc:mask="0x1" edc:name="SP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VInt" edc:desc="" edc:mask="0x1" edc:name="VInt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VEIC" edc:desc="" edc:mask="0x1" edc:name="VEIC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ITL" edc:desc="" edc:mask="0x1" edc:name="ITL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DSPP" edc:desc="" edc:mask="0x1" edc:name="DSPP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSP2P" edc:desc="" edc:mask="0x1" edc:name="DSP2P" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXI" edc:desc="" edc:mask="0x1" edc:name="RXI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ULRI" edc:desc="" edc:mask="0x1" edc:name="ULRI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISA" edc:desc="" edc:mask="0x3" edc:name="ISA" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ISAONEXC" edc:desc="" edc:mask="0x1" edc:name="ISAONEXC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCU" edc:desc="" edc:mask="0x1" edc:name="MCU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MMAR" edc:desc="" edc:mask="0x7" edc:name="MMAR" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="IPLW" edc:desc="" edc:mask="0x3" edc:name="IPLW" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="VZ" edc:desc="" edc:mask="0x1" edc:name="VZ" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="r-------------------------------" edc:cname="Config4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="Config4" edc:nmmrflags="0d" edc:nmmrid="704" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
