Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.1.45/edc/PIC32MZ0512EFE144.PIC
      <edc:SFRDef edc:_addr="0x1F8101F0" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC11" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC11" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCIS" edc:desc="" edc:mask="0x3" edc:name="ADCIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCIP" edc:desc="" edc:mask="0x7" edc:name="ADCIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCFIFOIS" edc:mask="0x3" edc:name="ADCFIFOIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCFIFOIP" edc:mask="0x7" edc:name="ADCFIFOIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCDC1IS" edc:desc="" edc:mask="0x3" edc:name="ADCDC1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDC1IP" edc:desc="" edc:mask="0x7" edc:name="ADCDC1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCDC2IS" edc:desc="" edc:mask="0x3" edc:name="ADCDC2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDC2IP" edc:desc="" edc:mask="0x7" edc:name="ADCDC2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810200" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC12" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC12" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCDC3IS" edc:desc="" edc:mask="0x3" edc:name="ADCDC3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDC3IP" edc:desc="" edc:mask="0x7" edc:name="ADCDC3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCDC4IS" edc:desc="" edc:mask="0x3" edc:name="ADCDC4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDC4IP" edc:desc="" edc:mask="0x7" edc:name="ADCDC4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCDC5IS" edc:desc="" edc:mask="0x3" edc:name="ADCDC5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDC5IP" edc:desc="" edc:mask="0x7" edc:name="ADCDC5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCDC6IS" edc:desc="" edc:mask="0x3" edc:name="ADCDC6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDC6IP" edc:desc="" edc:mask="0x7" edc:name="ADCDC6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810210" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC13" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC13" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCDF1IS" edc:desc="" edc:mask="0x3" edc:name="ADCDF1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDF1IP" edc:desc="" edc:mask="0x7" edc:name="ADCDF1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCDF2IS" edc:desc="" edc:mask="0x3" edc:name="ADCDF2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDF2IP" edc:desc="" edc:mask="0x7" edc:name="ADCDF2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCDF3IS" edc:desc="" edc:mask="0x3" edc:name="ADCDF3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDF3IP" edc:desc="" edc:mask="0x7" edc:name="ADCDF3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCDF4IS" edc:desc="" edc:mask="0x3" edc:name="ADCDF4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDF4IP" edc:desc="" edc:mask="0x7" edc:name="ADCDF4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810220" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC14" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC14" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCDF5IS" edc:desc="" edc:mask="0x3" edc:name="ADCDF5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDF5IP" edc:desc="" edc:mask="0x7" edc:name="ADCDF5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCDF6IS" edc:desc="" edc:mask="0x3" edc:name="ADCDF6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDF6IP" edc:desc="" edc:mask="0x7" edc:name="ADCDF6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCFLTIS" edc:mask="0x3" edc:name="ADCFLTIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCFLTIP" edc:mask="0x7" edc:name="ADCFLTIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD0IS" edc:desc="" edc:mask="0x3" edc:name="ADCD0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD0IP" edc:desc="" edc:mask="0x7" edc:name="ADCD0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
